teach/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-07 Mon 13:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Presentation Day</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Presentation Day</h1>


<div id="outline-container-orgfff2dd4" class="outline-2">
<h2 id="orgfff2dd4"><span class="section-number-2">1.</span> Outline</h2>
<div class="outline-text-2" id="text-1">
<p>
The main goal for this day is to be able to have each of the four groups take a 1/2 hour or so to share their project with the rest of the class. The nature of the presentations are pretty open. They can be power points and talking, assignments that we are guided through. It is fine if they require us to read something in advance for a discussion. The main goal we are trying to achieve is to extend the range of topics we are exposed to. Given the time constraint it is unlikely that we will be able to go very deeply into any of these topics in class so there is some expectation that part of the provided material should be a guide for us to continue our studies on our own via readings or on-line material and programming exercises we can pursue.
</p>
</div>
</div>

<div id="outline-container-orgbcad4fa" class="outline-2">
<h2 id="orgbcad4fa"><span class="section-number-2">2.</span> More Details</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Agree on a mathematical topic with me.</li>
<li>The topic should make a connection to mind/cognition/theory in some way, and also allow for some simple computing/programming activity that will help us to consider the practical and conceptual advantages of the different programming language styles for modeling such topics. It is also okay if the order of things is slightly reversed in that the some cognitive model is taken as the focal point and then the mathematical content is introduced subsidiary to that.</li>
<li>Each presentation should try to include:
<ul class="org-ul">
<li>an introduction to the topic (and ideally something to read in advance)</li>
<li>a presentation that summarizes the project to be done live in class</li>
<li>a clear designation of the new mathematics introduced</li>
<li>an explanation of the programming connection</li>
<li>guidance for continued study.</li>
<li>a written version of the report to be uploaded to Learn, and if appropriate the github repo, that provides the links and text necessary to understand the above points when the presenters are not there to talk about the material.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf23e571" class="outline-2">
<h2 id="orgf23e571"><span class="section-number-2">3.</span> Some Ideas</h2>
<div class="outline-text-2" id="text-3">
<p>
Comment: these topics are to be connected to our interest in modelling and simulation and generating explanations for cognition or neural activity. They are not to be presented as isolated domains of mathematics. 
</p>
<ul class="org-ul">
<li>Topological Data Analysis</li>
<li>Information Geometry</li>
<li>Higher Order Homotopy Theory</li>
<li>Bifurcation and Phase Analysis Methods</li>
</ul>

<p>
The list is not comprehensive, but just to give some examples and provide some ideas.
</p>
</div>
</div>

<div id="outline-container-org59478b7" class="outline-2">
<h2 id="org59478b7"><span class="section-number-2">4.</span> Companion and Optional Readings</h2>
<div class="outline-text-2" id="text-4">
<p>
To be provided by the groups as they organize their presentations. I organize them here by programming language for convenience.
</p>
</div>


<div id="outline-container-orgb400bc7" class="outline-3">
<h3 id="orgb400bc7"><span class="section-number-3">4.1.</span> Python</h3>
</div>

<div id="outline-container-org105e212" class="outline-3">
<h3 id="org105e212"><span class="section-number-3">4.2.</span> Racket</h3>
</div>

<div id="outline-container-orge664d3f" class="outline-3">
<h3 id="orge664d3f"><span class="section-number-3">4.3.</span> Julia</h3>
</div>

<div id="outline-container-org6a31544" class="outline-3">
<h3 id="org6a31544"><span class="section-number-3">4.4.</span> Probabilistic Programming</h3>
</div>
</div>

<div id="outline-container-orgf87de07" class="outline-2">
<h2 id="orgf87de07"><span class="section-number-2">5.</span> References</h2>
<div class="outline-text-2" id="text-5">
<div class="csl-bib-body">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Winter 2022</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2022-02-07 Mon 13:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
